/*
 ZEVMS冒险岛(079)游戏服务端
 脚本：玩具塔奖励领取
 */



var status;


function start() {
    status = -1;
    action(1, 0, 0);
}
//副本通关奖励区域
/*
cm.概率给物品(物品代码，固定数量，概率,备注)；
cm.概率给物品2(物品代码，随机数量，概率,备注)；
*/
function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    }
    if (mode == 1)
        status++;
    else
        status--;
    if (status == 0) {
        cm.sendNext("请确认你的道具栏有没有满,满了领不到东西喔。");
    } else if (status == 1) {
		//玩具盛产金属，恩
		
		cm.概率给物品2(4170007,5,100,"飞天猪的蛋");
		cm.概率给物品2(4000487,1,50,"暗影币");
		cm.概率给物品(2043003,1,5,"必成");
		cm.概率给物品(2043103,1,5,"必成");
		cm.概率给物品(2043203,1,5,"必成");
		cm.概率给物品(2043303,1,5,"必成");
		cm.概率给物品(2043703,1,5,"必成");
		cm.概率给物品(2043803,1,5,"必成");
		cm.概率给物品(2044003,1,5,"必成");
		cm.概率给物品(2044019,1,5,"必成");
		cm.概率给物品(2044103,1,5,"必成");
		cm.概率给物品(2044203,1,5,"必成");
		cm.概率给物品(2044303,1,5,"必成");
		cm.概率给物品(2044403,1,5,"必成");
		cm.概率给物品(2044503,1,5,"必成");
		cm.概率给物品(2044603,1,5,"必成");
		cm.概率给物品(2044703,1,5,"必成");
		cm.概率给物品(2044503,1,5,"必成");
		cm.概率给物品(2044908,1,5,"必成");
		cm.概率给物品2(4310014,200,100,"雪花币");
		
		
		//记录通关信息
		cm.getPlayer().endPartyQuest(1202);
	    cm.setBossRankCount("玩具塔",1);
	    cm.setBossLog("玩具塔");
        cm.worldMessage(2, "[副本-玩具塔] : 恭喜 " + cm.getPlayer().getName() + " 完成玩具塔副本。");
        cm.warp(221024500);
        cm.dispose();
    }
}
