/*
 咕咕冒险岛-PB
 */

var mobcount =[0,1,1,3,1,5,3,1,7,9]
var times = 0

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (status == 0 && mode == 0) {
        cm.dispose();
        return;
    }
    if (mode == 1) {
        status++;
    } else {
        status--;
    }
    if (status == 0) {
		times= cm.判断地图指定怪物数量(8820000)
        var selStr = "\r\n";
		if(cm.判断地图指定怪物数量(8820002)==0 && cm.判断地图指定怪物数量(8820005)==0 && cm.判断地图指定怪物数量(8820006)==0 && cm.判断地图指定怪物数量(8820003)==0 && cm.判断地图指定怪物数量(8820004)==0&& cm.判断地图指定怪物数量(8820001)==0&&cm.判断地图指定怪物数量(8820000)>=1&&cm.判断地图指定怪物数量(8820000)<=9){
			selStr += "品克缤并没有被你打败，它只是逃到另一个位面了，我可以帮你把它抓回来\r\n";
			selStr += " #L1##r帮我把它抓回来(已逃跑"+times+"次)#k#l\r\n";  
		}
		if(cm.判断地图指定怪物数量(8820002)==0 && cm.判断地图指定怪物数量(8820005)==0 && cm.判断地图指定怪物数量(8820006)==0 && cm.判断地图指定怪物数量(8820003)==0 && cm.判断地图指定怪物数量(8820004)==0&& cm.判断地图指定怪物数量(8820001)==0&&cm.判断地图指定怪物数量(8820000)>=10){
			selStr += "你终于打败了品克缤，领取你的奖励吧\r\n";
			selStr += " #L2##r领取奖励(请确保其他队长已经打开NPC再点击)#k#l\r\n";  
		}
        selStr += " #L3##r我不打了，我要退出#k#l\r\n";             
       
        cm.说明文字(selStr);
    } else if (status == 1) {
        switch (selection) {
			case 1:
				if(cm.判断地图指定怪物数量(8820001)!=0){
					cm.sendOk("已经帮你抓过了");
					cm.dispose();
					return
				}
				if(times<=8){
					for(var i =0;i<mobcount[times];i++){
						cm.指定地图召唤怪物(8820001, 270050100, 8, -43);
					}
					cm.指定地图召唤怪物(8820000, 270050100, 8, -43);
					cm.地图公告("[忘却神殿管理人]：我把PB从另一个位面拉了回来，再次击败它！");
					cm.dispose();
					return
				}else{
					cm.指定地图召唤怪物(8820001, 270050100, -461, -456);
					cm.指定地图召唤怪物(8820001, 270050100, -266, -456);
					cm.指定地图召唤怪物(8820001, 270050100, -507, -277);
					cm.指定地图召唤怪物(8820001, 270050100, -493, -99);
					cm.指定地图召唤怪物(8820001, 270050100, 8, -43);
					cm.指定地图召唤怪物(8820001, 270050100, 485, -102);
					cm.指定地图召唤怪物(8820001, 270050100, 493, -258);
					cm.指定地图召唤怪物(8820001, 270050100, 483, -456);
					cm.指定地图召唤怪物(8820001, 270050100, 291, -456);
					cm.指定地图召唤怪物(8820000, 270050100, 8, -43);
					cm.地图公告("[忘却神殿管理人]：它发怒了！击败它，这一定是最后一次了！");
					cm.dispose();
					return
				}
				
            case 2:
				if (!cm.isLeader()) {
					cm.sendNext("只有队长才可以领取奖励");
					cm.dispose();
					return
				}
                cm.给团队道具(2022613,2);
				cm.givePartyBossLog("PBboss");
				cm.warpParty(270050000);
				cm.getMap(270050100).resetFully();
				cm.全服黄色喇叭("[PB] : ["+cm.getPlayer().getName()+"]和他的小伙伴们完成了对品克缤的讨伐！")
				cm.dispose();
                break;
			case 3:
                cm.warp(270050000, 0);
				if (cm.判断指定地图玩家数量(270050100) == 0) { 
					cm.getMap(270050100).resetFully();
				}
                cm.dispose();
                break;
        }
    }
} 