function start() {
    status = -1;

    action(1, 0, 0);
}
function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    }
    else {
        if (status >= 0 && mode == 0) {

            cm.sendOk("感谢你的光临！");
            cm.dispose();
            return;
        }
        if (mode == 1) {
            status++;
        }
        else {
            status--;
        }
        if (status == 0) {
            var tex2 = "";
            var text = "";
            for (i = 0; i < 10; i++) {
                text += "";
            }
			text += "\t\t\t\t#e#b  冒险岛新人礼包 #k	#n\r\n"
			text += "#b\t#v1402001##v1432000##v1442000##v1372005##v1452002##v1462001##v1472000##v1332000##v1492000##v1482000##l\r\n"//3
			text += "#b\t本职业10级武器(70级武器的攻击，100命中和10四维)#l\r\n"//3
            text += "#b\t#v1142101# * 《 全属性20 攻击力 +#r15#b》#l\r\n"//3
            text += "#b\t#v2022465# * 《 随机经验金币技能点 》 x #r30#l\r\n"//3
            text += "#b\t#v1932243#[随机皇家坐骑] *1#l\r\n"//3
            text += "#b\t#v2012000##z2012000# *20#l\r\n"//3
            text += "#b\t#v2000019##z2000019# *400#l\r\n"//3
            text += "#b\t#v2340000##z2340000# *5#l\r\n"//3
            //text += "#b\t盛大点券 #r 300000点卷#l\r\n"//3
            text += "#b\t\额外赠送金币#r 3000000  #l\r\n\r\n"//3
            text += "#L1##r确定领取大礼包就点我吧！#l\r\n\r\n"//3
            cm.sendSimple(text);
        } else if (selection == 1) {

			if(cm.getPlayer().getOneTimeLog("新人礼包") == 0){
			var job = cm.判断职业();
			if(job == 100 || job == 110 || job == 111 || job == 112 || job == 120 || job == 121 || job == 122 || job == 130 || job == 131 || job == 132 || job == 1100 || job == 1110 || job == 1111 || job == 1112){
				cm.给属性装备(1402001,0,0,10,10,10,10,1000,1000,85,0,0,0,0,100,23,40,0);
				cm.给属性装备(1432000,0,0,10,10,10,10,1000,1000,87,0,0,0,0,100,23,40,0);
			}
			else if(job == 2000 || job == 2100 || job == 2110 || job == 2111 || job == 2112){
				cm.给属性装备(1442000,0,0,10,10,10,10,1000,1000,87,0,0,0,0,100,23,40,0);
			}
			else if(job == 200 || job == 210 || job == 211 || job == 212 || job == 220 || job == 221 || job == 222 || job == 230 || job == 231 || job == 232 || job == 1200 || job == 1210 || job == 1211 || job == 1212){
				cm.给属性装备(1372005,0,0,10,10,10,10,1000,1000,51,83,0,0,0,100,23,40,0);
			}
			
			else if(job == 300 || job == 310 || job == 311 || job == 312 || job == 320 || job == 321 || job == 322 || job == 1300 || job == 1310 || job == 1311 || job == 1312){
				cm.给属性装备(1452002,0,0,10,10,10,10,1000,1000,80,0,0,0,0,100,23,40,0);
				cm.给属性装备(1462001,0,0,10,10,10,10,1000,1000,83,0,0,0,0,100,23,40,0);
				cm.gainItem(2060000, 1000);
				cm.gainItem(2061000, 1000);
			}
			
			else if(job == 400 || job == 410 || job == 411 || job == 412 || job == 420 || job == 421 || job == 422 || job == 1400 || job == 1410 || job == 1411 || job == 1412){
				cm.给属性装备(1472000,0,0,10,10,10,10,1000,1000,34,0,0,0,0,100,23,40,0);
				cm.给属性装备(1332000,0,0,10,10,10,10,1000,1000,80,0,0,0,0,100,23,40,0);
				cm.gainItem(2070006, 1);
			}
			
			else if(job == 500 || job == 510 || job == 511 || job == 512 || job == 520 || job == 521 || job == 522 || job == 1500 || job == 1510 || job == 1511 || job == 1512){
				cm.给属性装备(1492000,0,0,10,10,10,10,1000,1000,62,0,0,0,0,100,23,40,0);
				cm.给属性装备(1482000,0,0,10,10,10,10,1000,1000,62,0,0,0,0,100,23,40,0);
				
			}else{
				cm.sendOk("检测职业失败，请转职后再尝试！");
				cm.dispose();
				return;
			
			}
			//var job = cm.判断职业();
			cm.给经验(20000);
			cm.gainItem(2022678, 1);
			cm.gainItem(2012000, 20);
			cm.gainItem(2022465, 30);
			cm.gainItem(2000019, 400);
			cm.gainItem(2340000, 5);
			cm.gainMeso(3000000);
			cm.给属性装备(1142101, 1, 1, 20, 20, 20, 20, 500, 500, 15, 15,0, 0, 0, 0, 40, 40, 0);
			cm.sendOk("购买成功！");
			cm.getPlayer().setOneTimeLog("新人礼包");
			cm.全服黄色喇叭("[新人礼包] : 恭喜玩家 "+cm.getPlayer().getName()+" 成功领取了新人大礼包。")
			cm.dispose();
			}else{
            cm.sendOk("#e#b一个人只能领取一次\r\n ");
            cm.dispose();
			}
		}
	}
}