/*
 咕咕冒险岛-成就系统
 */

var sumpoint = 0
var allpoint = 0
//0成就名，1成就点数，2完成状态标记，3奖励道具标记(0普通，其他装备属性)，4奖励道具编码，5奖励道具数量，6达成条件，7log名，8要求次数，9成就标记(1.onetimelog;2.bossrank;3.道具数量)
var list = [
["暂停闹钟",1,"#r",0,4000463,10,"完成10次闹钟每日","闹钟成就",10,1],
["关闭闹钟",2,"#r",0,4000463,50,"完成30次闹钟每日","闹钟成就",30,1],
["砸碎闹钟",3,"#r",0,4000463,200,"完成100次闹钟每日","闹钟成就",100,1],
["屠熊大师",1,"#r",0,4000463,10,"完成10次暴力熊每日","暴力熊成就",10,1],
["灭熊达人",2,"#r",0,4000463,50,"完成30次暴力熊每日","暴力熊成就",30,1],
["烹熊专家",3,"#r",0,4000463,200,"完成100次暴力熊每日","暴力熊成就",100,1],
["伐木者",1,"#r",0,4000463,10,"完成10次树精每日","树精成就",10,1],
["环境破坏者",2,"#r",0,4000463,50,"完成30次树精每日","树精成就",30,1],
["生态毁灭者",3,"#r",0,4000463,200,"完成100次树精每日","树精成就",100,1],
["讨伐扎昆",1,"#r",0,4000463,10,"完成10次扎昆每日","扎昆成就",10,1],
["扎昆灭杀者",2,"#r",0,4000463,50,"完成30次扎昆每日","扎昆成就",30,1],
["拯救雪域",3,"#r",0,4000463,200,"完成100次扎昆每日","扎昆成就",100,1],
["屠龙勇士",1,"#r",0,4000463,10,"完成10次黑龙每日","黑龙成就",10,1],
["龙角收藏家",2,"#r",0,4000463,50,"完成30次黑龙每日","黑龙成就",30,1],
["封龙之戟",3,"#r",0,4000463,200,"完成100次黑龙每日","黑龙成就",100,1],
["呔！妖怪",1,"#r",0,4000463,10,"完成10次妖僧每日","妖僧成就",10,1],
["少林英雄",2,"#r",0,4000463,50,"完成30次妖僧每日","妖僧成就",30,1],
["拯救少林",3,"#r",0,4000463,200,"完成100次妖僧每日","妖僧成就",100,1],
["PB必须死",2,"#r",0,2022613,2,"完成10次PB副本","PB成就",10,1],
["位面拯救者",4,"#r",0,2022613,4,"完成30次PB副本","PB成就",30,1],
["萌物屠杀者",6,"#r",100,1142008,1,"完成100次PB副本","PB成就",100,1],
["Boss杀手",5,"#r",66,1142863,1,"完成5次每日boss","每日boss成就",5,1],
["Boss屠戮者",10,"#r",100,1142865,1,"完成14次每日boss","每日boss成就",14,1],
["无双杀手",20,"#r",300,1142867,1,"完成60次每日boss","每日boss成就",60,1],
["品尝年糕",1,"#r",0,4000463,10,"完成20次月妙","月妙",20,2],
["月妙守护者",2,"#r",0,4000463,50,"完成60次月妙","月妙",60,2],
["兔叽之友",3,"#r",0,4000463,200,"完成200次月妙","月妙",100,2],
["初遇大水灵",1,"#r",0,4000463,10,"完成20次废弃组队","废弃都市",20,2],
["废都英雄",2,"#r",0,4000463,50,"完成60次废弃组队","废弃都市",60,2],
["废都守护者",3,"#r",0,4000463,200,"完成200次废弃组队","废弃都市",200,2],
["调查玩具塔",1,"#r",0,4000463,10,"完成20次玩具组队","玩具塔",20,2],
["玩具塔之秘",2,"#r",0,4000463,50,"完成60次玩具组队","玩具塔",60,2],
["玩具建筑师",3,"#r",0,4000463,200,"完成200次玩具组队","玩具塔",200,2],
["海盗杀手",1,"#r",0,4000463,10,"完成20次海盗组队","海盗船",20,2],
["海盗之灾",2,"#r",0,4000463,50,"完成60次海盗组队","海盗船",60,2],
["海贼王！",3,"#r",0,4000463,200,"完成200次海盗组队","海盗船",200,2],
["净化毒雾",1,"#r",0,4000463,10,"完成20次毒雾组队","毒雾森林",20,2],
["空气清新剂",2,"#r",0,4000463,50,"完成60次毒雾组队","毒雾森林",60,2],
["冒险岛之肺",3,"#r",0,4000463,200,"完成200次毒雾组队","毒雾森林",200,2],
["见证真爱",1,"#r",0,4000463,10,"完成20次罗密欧组队","罗密欧与朱丽叶",20,2],
["真爱守护者",2,"#r",0,4000463,50,"完成60次罗密欧组队","罗密欧与朱丽叶",60,2],
["狗粮品鉴师",3,"#r",0,4000463,200,"完成200次罗密欧组队","罗密欧与朱丽叶",200,2],
["组队达人",5,"#r",40,1012057,1,"完成5次每日组队","每日组队成就",5,1],
["完美一条龙",10,"#r",80,1012057,1,"完成14次每日组队","每日组队成就",14,1],
["肝帝归来",20,"#r",120,1012057,1,"完成60次每日组队","每日组队成就",60,1],
["一发入魂",5,"#r",0,4310060,10,"1枚暴君币抽中暴君","一发入魂成就",1,1],
["暴君绝缘体",10,"#r",0,2022466,1,"单次使用40枚未抽中暴君","暴君绝缘体成就",1,1],
["江山如画",5,"#r",0,4430000,10,"将暴君装备强化至江山如画","江山如画成就",1,1],
["金花你马",5,"#r",0,4310027,100,"累计制作5个属性低于250的金花戒指","金花你马成就",5,1],
["完美主义",10,"#r",0,4000463,200,"制作1个600属性的金花戒指","完美主义成就",1,1],
["瓦坎达forever",20,"#r",0,4310027,200,"使用强运制作一个属性低于250的戒指","瓦坎达forever成就",1,1],
["仓鼠型玩家",5,"#r",0,4430000,10,"拥有500个[必成卷自选箱子]",2022468,500,3],
["装备毁灭者",5,"#r",0,4430000,10,"使用超级混沌单次减少60六维","装备毁灭者成就",1,1],
["强化大师",5,"#r",0,4000463,100,"使用自助强化累计10次属性增加达到30","强化大师成就",10,1],
["我全都要",2,"#r",0,4001126,200,"通关月妙时身上拥有至少50个年糕","我全都要成就",1,2],
["最快的男人",5,"#r",0,4000463,100,"2分钟内通关废都组队任务","最快的男人成就",1,2],
["椅子搜集狂魔",5,"#r",80,1112900,1,"累计抽取300次椅子","椅子搜集狂魔成就",300,1],
]


 function start() {
    status = 0;
    action(1, 0, 0);
}



function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status >= 2) {
            cm.sendOk(" 等你想去哪里了，记得找我哦！");
            cm.dispose();
            return;
        }
        status--;
    }
    if (status == 0) {
    } else if (status == 1) {
		for(var i =0;i<list.length;i++){
			allpoint += list[i][1]
			if(list[i][9]==1 && cm.getPlayer().getOneTimeLog(list[i][7]) >= list[i][8]){
				list[i][2]="#g"
			}
			if(list[i][9]==2 && cm.getBossRank(list[i][7], 2)+1 >= list[i][8]){
				list[i][2]="#g"
			}
			if(list[i][9]==3 && cm.haveItem(list[i][7],list[i][8])){
				list[i][2]="#g"
			}
			if(cm.getPlayer().getOneTimeLog(list[i][0]+"领取") >= 1){
				list[i][2]="#b"
				sumpoint += list[i][1]
			}
		}
		
        var selStr = "当前成就点数："+sumpoint+"/"+allpoint+"\r\n状态显示：#r未完成 #g可完成 #b已完成#k";
        
			selStr += "\r\n#L999##b成就里程碑奖励#k#l";
			selStr += "\r\n\r\n#b【boss系列】#k  #L1000#查看介绍#l";
			selStr += "\r\n#L0#"+list[0][2]+"暂停闹钟#k#l   #L1#"+list[1][2]+"关闭闹钟#k#l   #L2#"+list[2][2]+"砸碎闹钟#k#l";
			selStr += "\r\n#L3#"+list[3][2]+"屠熊大师#k#l   #L4#"+list[4][2]+"灭熊达人#k#l   #L5#"+list[5][2]+"烹熊专家#k#l";
			selStr += "\r\n#L6#"+list[6][2]+"伐木者#k#l     #L7#"+list[7][2]+"环境破坏者#k#l #L8#"+list[8][2]+"生态毁灭者#k#l";
			selStr += "\r\n#L9#"+list[9][2]+"讨伐扎昆#k#l   #L10#"+list[10][2]+"扎昆灭杀者#k#l #L11#"+list[11][2]+"拯救雪域#k#l";
			selStr += "\r\n#L12#"+list[12][2]+"屠龙勇士#k#l   #L13#"+list[13][2]+"龙角收藏家#k#l #L14#"+list[14][2]+"封龙之戟#k#l";
			selStr += "\r\n#L15#"+list[15][2]+"呔！妖怪#k#l   #L16#"+list[16][2]+"少林英雄#k#l   #L17#"+list[17][2]+"拯救少林#k#l";
			selStr += "\r\n#L18#"+list[18][2]+"PB必须死#k#l   #L19#"+list[19][2]+"位面拯救者#k#l #L20#"+list[20][2]+"萌物屠杀者#k#l";
			selStr += "\r\n#L21#"+list[21][2]+"Boss杀手#k#l   #L22#"+list[22][2]+"Boss屠戮者#k#l #L23#"+list[23][2]+"无双杀手#k#l";
			selStr += "\r\n\r\n#b【组队任务系列】#k  #L1001#查看介绍#l";
			selStr += "\r\n#L24#"+list[24][2]+"品尝年糕#k#l   #L25#"+list[25][2]+"月妙守护者#k#l #L26#"+list[26][2]+"兔叽之友#k#l";
			selStr += "\r\n#L27#"+list[27][2]+"初遇大水灵#k#l #L28#"+list[28][2]+"废都英雄#k#l   #L29#"+list[29][2]+"废都守护者#k#l";
			selStr += "\r\n#L30#"+list[30][2]+"调查玩具塔#k#l #L31#"+list[31][2]+"玩具塔之秘#k#l #L32#"+list[32][2]+"玩具建筑师#k#l";
			selStr += "\r\n#L33#"+list[33][2]+"海盗杀手#k#l   #L34#"+list[34][2]+"海盗之灾#k#l   #L35#"+list[35][2]+"海贼王！#k#l";
			selStr += "\r\n#L36#"+list[36][2]+"净化毒雾#k#l   #L37#"+list[37][2]+"空气清新剂#k#l #L38#"+list[38][2]+"冒险岛之肺#k#l";
			selStr += "\r\n#L39#"+list[39][2]+"见证真爱#k#l   #L40#"+list[40][2]+"真爱守护者#k#l #L41#"+list[41][2]+"狗粮品鉴师#k#l";
			selStr += "\r\n#L42#"+list[42][2]+"组队达人#k#l   #L43#"+list[43][2]+"完美一条龙#k#l #L44#"+list[44][2]+"肝帝归来#k#l";
			selStr += "\r\n\r\n#b【特殊成就】#k  #L1002#查看介绍#l";
			selStr += "\r\n#L45#"+list[45][2]+"一发入魂#k#l   #L46#"+list[46][2]+"暴君绝缘体#k#l #L47#"+list[47][2]+"江山如画#k#l";
			selStr += "\r\n#L48#"+list[48][2]+"金花你马#k#l   #L49#"+list[49][2]+"完美主义#k#l   #L50#"+list[50][2]+"瓦坎达forever#k#l";
			selStr += "\r\n#L51#"+list[51][2]+"仓鼠型玩家#k#l #L52#"+list[52][2]+"装备毁灭者#k#l #L53#"+list[53][2]+"强化大师#k#l";
			selStr += "\r\n#L54#"+list[54][2]+"我全都要#k#l   #L55#"+list[55][2]+"最快的男人#k#l #L56#"+list[56][2]+"椅子搜集狂魔#k#l";
			
        
        cm.sendSimple(selStr);
    } else if (status == 2) {
        if(selection >= 0 && selection <= 500){
			var choose = selection
			if(list[choose][2]=="#b"){
				cm.sendOk("已经完成了，不能重复完成")
				cm.dispose();
				return
			}
			if(list[choose][2]=="#r"){
				cm.sendOk("还没有完成，加油吧")
				cm.dispose();
				return
			}
			if(list[choose][3]==0){
				cm.gainItem(list[choose][4],list[choose][5])
			}else{
				cm.给属性装备(list[choose][4], 0, 0, list[choose][3], list[choose][3], list[choose][3], list[choose][3], list[choose][3], list[choose][3], list[choose][3], list[choose][3],0, 0, 0, 0, 0, 0, 0);
			}
			cm.全服黄色喇叭("[成就系统] : 恭喜["+cm.getPlayer().getName()+"]完成了["+list[choose][0]+"]成就")
			cm.getPlayer().setOneTimeLog(list[choose][0]+"领取")
			cm.sendOk("完成成功")
			cm.dispose();
			return
		}
		if(selection == 1000 || selection == 1001 || selection == 1002){
			var str1000 ="boss成就介绍"
			var count1000 = 0
			var startlist = 0
			var finallist = 24
			if(selection == 1001){
				startlist = 24
				finallist = 45
			}
			if(selection == 1002){
				startlist = 45
				finallist = list.length
			}
			for(var i = startlist; i < finallist ;i++){
				if(list[i][9]==1){
					count1000 = cm.getPlayer().getOneTimeLog(list[i][7])
				}
				if(list[i][9]==2){
					count1000 = cm.getBossRank(list[i][7], 2)+1
				}
				if(list[i][9]==3){
					count1000 = 0
				}
				if(count1000 >= list[i][8]){
					count1000 = list[i][8]
				}
				if(list[i][3]==0){
					str1000 += "\r\n\r\n"+list[i][2]+"【"+list[i][0]+"】点数("+list[i][1]+")进度("+count1000+"/"+list[i][8]+")\r\n"+list[i][6]+"；奖励#v"+list[i][4]+"#x"+list[i][5]+"#k\r\n"
				}else{
					str1000 += "\r\n\r\n"+list[i][2]+"【"+list[i][0]+"】点数("+list[i][1]+")进度("+count1000+"/"+list[i][8]+")\r\n"+list[i][6]+"；奖励#v"+list[i][4]+"#全属性+"+list[i][3]+"#k\r\n"
				}
			}
			cm.sendOk(str1000)
			cm.dispose();
			return
		}
		if(selection == 999){
			cm.sendOk("制作中...")
			cm.dispose();
			return
		}
    } else if (status == 3) {
		cm.sendOk("异常");
        cm.dispose();
    }
}