/*
 ZEVMS冒险岛(079)游戏服务端
 道具制作
 */
var 装备 = [
    /*************
     手套
     *************/
    //重生定边手套
    1452301,
    1402317,
    1402318,
    1402320,
    //重生逍遥手套
    1452300,
    //重生白云手套
    1452303,
    //重生探云手套
    1452304,
    /*************
     鞋子
     *************/
    //重生坚壁靴
    1302311,
    //重生缥缈鞋
    1402308,
    //重生彩虹鞋
    1402309,
    //重生舞空靴
    1402310,
    //重生定海靴
    1402311,
    /*************
     套服
     *************/
    //重生演武铠
    1402312,
    /*************
     帽子
     *************/
    //重生冠军盔
    1402315,
    //重生玄妙帽
    1402316,
    //重生霓翎帽
    1402328,
    //重生迷踪帽
    1402329,
    //重生海王星
    1402330,
    /*************
     武器
     *************/
    //重生破甲剑
    1402330,
    //重生断蚺斧
    1432154,
    //重生惊破天
    1432155,
    //重生狂鲨锯
    1432156,
    //重生断首刃
    1402327,
    //重生蝶翼杖
    1402325,
    //重生冰轮杖
    1402324,
    //重生玄冥剑
    1402323,
    //重生碎鼋斧
    1402322,
    //重生威震天
    1402321,
    //重生显圣枪
    1402319
];
//说明文字
var 说明文字 = "   hi #b#h ##k 请选择你要的神器吧\r\n[#r属性都是400六维#k]，\r\n选择后是不能反悔的哦，#r进入此页面后请勿不选择#k，箱子已经被消耗。";


var sels;
var 脚本执行 = -1;

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        脚本执行++;
    } else if (mode == 0) {
        脚本执行--;
    } else {
        cm.对话结束();
        return;
    }
    if (脚本执行 == 0) {
        var 文本信息 = "";
        for (var i = 0; i < 装备.length; i++) {
            文本信息 += "#b#L" + i + "#";
            文本信息 += "#i" + 装备[i] + "##z" + 装备[i] + "##l#k\r\n";
         
        }

        cm.sendSimple("" + 说明文字 + "\r\n" + 文本信息 + "");
    } else if (脚本执行 == 1) {
        sels = selection;
        //cm.gainItem(装备[sels], 1);
		cm.给属性装备(装备[sels], 10, 0, 400, 400, 400, 400, 0, 0, 400, 400,0, 0, 0, 0, 40, 40, 0);
        cm.gainItem(2022467, -1);
        cm.说明文字("恭喜你获得 " + cm.显示物品(装备[sels]) + "");
		//cm.输出记录("礼包兑换记录/重生套装兑换记录.txt",""+cm.时间()+" : "+cm.getChar().getName()+" 兑换了 "+cm.getItemName(装备[sels])+" \r\n");
        cm.对话结束();
    } else {
        cm.说明文字("#r发生错误: mode : " + mode + " 脚本执行 : " + 脚本执行);
        cm.对话结束();
    }
}